# A couple leetcode problems

### Problem 1

Loading our data.

In [7]:
import pandas as pd
import sqlite3

conn = sqlite3.connect('crm')
employee_df = pd.read_csv('./employees.csv')
employee_df.to_sql('employees', conn, index = False, if_exists = 'replace')

5

In [8]:
pd.read_sql('select * from employees', conn)

   employee_id     name  salary
0            2     Meir    3000
1            3  Michael    3800
2            7  Addilyn    7400
3            8     Juan    6100
4            9   Kannon    7700

Write a solution to calculate the bonus of each employee. The bonus of an employee is 100% of their salary if the ID of the employee is an odd number and the employee's name does not start with the character 'M'. The bonus of an employee is 0 otherwise.

Return the result table ordered by `employee_id`.

In [19]:
query = """
select * from employees
"""

pd.read_sql(query, conn)

# 	employee_id	bonus
# 0	2	0
# 1	3	0
# 2	7	7400
# 3	8	0
# 4	9	7700

   employee_id     name  salary
0            2     Meir    3000
1            3  Michael    3800
2            7  Addilyn    7400
3            8     Juan    6100
4            9   Kannon    7700

### Problem two

Ok, onto the next problem.  Let's load our data.

In [13]:
import pandas as pd
import sqlite3

conn = sqlite3.connect('crm')
employee_df = pd.read_csv('./department.csv')
employee_df.to_sql('departments', conn, index = False, if_exists = 'replace')

5

In [15]:
pd.read_sql('select * from departments', conn)

   id  revenue month
0   1     8000   Jan
1   2     9000   Jan
2   3    10000   Feb
3   1     7000   Feb
4   1     6000   Mar

Reformat the table such that there is a department id column and a revenue column for each month.

In [20]:
query = """
select * from departments
"""

pd.read_sql(query, conn)

# 	id	Jan_Revenue	Feb_Revenue	Mar_Revenue	Apr_Revenue	May_Revenue	Jun_Revenue	Jul_Revenue	Aug_Revenue	Sep_Revenue	Oct_Revenue	Nov_Revenue	Dec_Revenue
# 0	1	8000.0	7000.0	6000.0	None	None	None	None	None	None	None	None	None
# 1	2	9000.0	NaN	NaN	None	None	None	None	None	None	None	None	None
# 2	3	NaN	10000.0	NaN	None	None	None	None	None	None	None	None	None

   id  revenue month
0   1     8000   Jan
1   2     9000   Jan
2   3    10000   Feb
3   1     7000   Feb
4   1     6000   Mar

### Explanation

Essentially, we are asked to create a pivot table.  And the way to do that is to create new columns with a `case when` statement only returning results for the column for the corresponding month.  And then grouping and summing up the values to aggregate by id.

Note that we do perform a sum -- but because there is only one value per month and id, we are never adding two values together.  So we could also use max and get the same answer.